In [2]:
import numpy as np
import pandas as pd

In [5]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df = pd.read_csv('example')

In [7]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
df.to_csv("My_Output",index=False)

In [9]:
pd.read_csv("My_Output")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [12]:
import numpy as np
import pandas as pd

In [18]:
pd.read_excel('Excel_Sample.xlsx)

SyntaxError: EOL while scanning string literal (<ipython-input-18-67f2535e3fbe>, line 1)

In [20]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [21]:
df

[                             Bank Name        City  ST   CERT  \
 0                   Ericson State Bank     Ericson  NE  18265
 1     City National Bank of New Jersey      Newark  NJ  21111
 2                        Resolute Bank      Maumee  OH  58317
 3                Louisa Community Bank      Louisa  KY  58112
 4                 The Enloe State Bank      Cooper  TX  10716
 ..                                 ...         ...  ..    ...
 555                 Superior Bank, FSB    Hinsdale  IL  32646
 556                Malta National Bank       Malta  OH   6629
 557    First Alliance Bank & Trust Co.  Manchester  NH  34264
 558  National State Bank of Metropolis  Metropolis  IL   3815
 559                   Bank of Honolulu    Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0             Farmers and Merchants Bank  February 14, 2020
 1                        Industrial Bank   November 1, 2019
 2                     Buckeye State Bank   October 25, 2019
 3      Kentucky Farmers Bank Corporation   October 25, 2019
 4                     Legend Bank, N. A.       May 31, 2019
 ..                                   ...                ...
 555                Superior Federal, FSB      July 27, 2001
 556                    North Valley Bank        May 3, 2001
 557  Southern New Hampshire Bank & Trust   February 2, 2001
 558              Banterra Bank of Marion  December 14, 2000
 559                   Bank of the Orient   October 13, 2000

 [560 rows x 6 columns]]

In [5]:
import numpy as np
import pandas as pd

In [6]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
from sqlalchemy import create_engine

In [8]:
engine = create_engine('sqlite:///:memory:')

In [9]:
df.to_sql('data', engine)

In [10]:
sql_df = pd.read_sql('data',con=engine)

In [11]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15